{
	"notFound": "No se ha encontrado esa traduccion. (Error interno)",
	"yes": "Si.",
	"no": "No.",

	"starboard": {
		"errCreateGuildData": "Un error ocurrio tratando de crear los datos de tu servidor: %v",
		"errNoSubCommand": "No se pudo obtener el subcomando.",
		"alreadyOnSetup": "No puedes hacer dos setups a la vez.",

		"interactivo": {
			"skip": "Omitir",
			"terminated": "No confirmaste los datos de la starboard. El setup termino.",

			"errTimeout": "Se acabo el tiempo... Intenta usar el comando de nuevo.",
			"errNoChannel": "Puede que hayas seleccionado un canal pero yo no lo recibi, intenta de nuevo.",
			"errCollector": "Ha ocurrido un error desconocido tratando de recibir lo que ingresaste: %v",
			"errNoValidEmoji": "Necesitas ingresar un (solo) emoji valido.",
			"errNoValidNumber": "Necesitas ingresar un numero valido.",
			"errNoValidRequired": "Las reacciones requeridas no pueden ser menores o iguales a 0.",
			"errNoValidRequiredToS": "Las reacciones requeridas para no salir de la starboard no pueden ser menores a 0 o mayores que las requeridas.",
			"errNoValidName": "El nombre de la starboard no puede ser mayor a 100 caracteres!",

			"placeholderSelectChannel": "Selecciona un canal.",

			"selectChannel": "Selecciona el canal donde quieres que aparezcan los mensajes de la starboard.",
			"selectEmoji": "Escribe el emoji que quisieras que fuera el emoji para la starboard.",
			"selectName": "Escribe el nombre de la starboard nueva. Si no eliges el nombre, se usara el nombre del canal elegido.",
			"selectRequired": "Escribe la cantidad de reacciones que se necesitan para que un mensaje salga en la starboard.",
			"selectRequiredToS": "Escribe la cantidad de reacciones que se necesitan para que el mensaje **NO** salga de la starboard.",
			"selectBotsReact": "¿Quieres que las reacciones de los bots cuenten para que un mensaje salga en la starboard? (Por Defecto: No)",
			"selectBotsMsg": "¿Quieres que los mensajes de los bots puedan salir en la starboard? (Por Defecto: No)",
			"selectEmbedColor": "Elige algun color (hexadecimal) que quieras que tengan los embeds de la starboard (Por Defecto: #fe9cb1).\nPuedes usar este link: \"https://htmlcolorcodes.com/\"",

			"optionalParam": " (Esta opcion es opcional, usa el boton de \"Omitir\", para saltarte esta opcion)",

			"useButtons": " (Usa los botones para decidir \"Si\" o \"No\")",

			"starboardCreating": "Creando Starboard",
			"starboardCreated": "Starboard creada",

			"starboardDesc": "La starboard ha sido creada, para configurar datos de esta o cambiar a lista blanca o añadir canales a la lista usa: `/starboard editar`",

			"starboardConfirm": "Revisa la informacion de tu starboard, si esta correcta usa los botones.",

			"starboardData": "> **Datos Starboard**\n",
			"starboardDataChannel": "Canal: <#%v>\n",
			"starboardDataEmoji": "Emoji: %v\n",
			"starboardDataName": "Nombre: `%v`",

			"starboardRequisites": "> **Requisitos Starboard**\n",
			"starboardRequisitesRequired": "Reacciones requeridas: **%v**\n",
			"starboardRequisitesRequiredToS": "Reacciones requeridas para quedarse: **%v**\n",
			"starboardRequisitesBotsReact": "Bots pueden reaccionar?: `%v`\n",
			"starboardRequisitesBotsMsg": "Mensajes de bots cuentan?: `%v`"
		},

		"manual": {
			"errFindGuildStarboards": "Un error ocurrio tratando de obtener las starboards de tu servidor: %v",
			"errCreateStarboard": "Un error ocurrio tratando de guardar los datos de tu starboard: %v",
			"errFindEmoji": "Un error ocurrio tratando de obtener el emoji de tu starboard: %v",
			"errNoGuildData": "No se encontro los datos de tu servidor, intenta usar el comando de nuevo.",

			"channelAlreadyUsed": "Ya hay una starboard en el canal ingresado.",
			"channelInList": "El canal ya esta en la lista de la starboard `%v`, no puedes elegir canales que esten en una lista de una starboard.",

			"noValidChannel": "El canal ingresado no puede ser un canal donde ya hay una starboard.\nTampoco un canal que es parte de la lista de canales de alguna starboard en \"lista blanca\".",
			"noEmoji": "Necesitas ingresar un emoji para hacer la starboard.",
			"noUniqueEmoji": "Necesitas ingresar un emoji que no sea usado en otro starboard.",
			"noValidEmoji": "Necesitas ingresar un (solo) emoji valido.",
			"noRequired": "Necesitas ingresar un numero de reacciones requeridas para salir en la starboard.",
			"noValidRequired": "Las reacciones necesarias no pueden ser menores o iguales a 0",
			"noRequiredToStay": "Necesitas ingresar un numero de reacciones requeridas para quedarse en la starboard.",
			"noValidRequiredToStay": "Las reacciones necesarias para quedarse no pueden ser menores a 0 o mayores o iguales que las reacciones necesarias.",
			"noValidName": "El nombre de la starboard no puede ser mayor a 100 caracteres.",
			"noValidHex": "El hex color que ingresaste no es valido. Para obtener un hex color entra aqui: \"https://htmlcolorcodes.com/\"\nElige un color que te guste y encuentra la parte donde aparece algo asi \"#F10AAF\" (ejemplo)\nDebe estar al lado de donde dice \"HEX\", copialo y vuelve a correr el comando. Recuerda que debe de tener el #.",
			"noValidParsedHex": "Ocurrió un error al parsear el color del embed, probablemente es invalido.",
			"noChannelsOnWhite": "Ingresaste como tipo de lista **blanco** (true), necesitas al menos ingresar una id de canal.",
			"noValidChannelId": "\"%v\" no es una ID de un canal.",

			"starboardCreated": "Starboard creada",
			"starboardData": "> **Datos Starboard**\nNombre: `%v`\nCanal: <#%v>\nEmoji: %v",
			"starboardRequisites": "> **Requisitos Starboard**\nReacciones requeridas: **%v**\nReacciones requeridas para quedarse: **%v**\nBots pueden reaccionar?: `%v`\nMensajes de bots cuentan?: `%v`",
			"starboardCustom": "> **Customizacion**\nColor del embed: `#%v`"
		}
	}
}
